<template>
<!-- 走进协会 -->
    <div class='association'>
        <div class='width-min'>
            <img src="@/assets/img/banner-1.jpg" alt="">
        </div>
        <main class="width-1180 box-flex">
            <div class='association-left'>
                <h3 class="association-left-title">走进协会</h3>
                <ul class="association-left-ul">
                    <li :class="listIndex==i?'association-left-item pointer active':'association-left-item pointer'" @click='listIndex = i' v-for="(item,i) in listNAV" :key='i'>{{item}}</li>
                </ul>
            </div>
            <div class='association-right'>
                <div class="association-right-title flex-center" :style="'background:url('+bgTitle+') no-repeat 50% 50%'">
                    <h3>{{listNAV[listIndex]}}</h3>
                </div>
                <div class="association-right-content" v-if="listIndex === 0">
                    <img class="img-float" src="@/assets/img/img-1.png" alt="">
                    <span>&nbsp;&nbsp;&nbsp;&nbsp;北京排水协会是由北京城市排水集团有限责任公司等9家单位共同发起成立，是经北京市社会团体登记管理机关核准登记的非营利性社会团体法人组织，业务主管单位是北京市水务局，同时接受北京市民政局的业务指导和监督管理。<br>&nbsp;&nbsp;&nbsp;&nbsp;
                        北京排水协会于2007年6月正式获准成立。协会的宗旨是：遵守宪法、法律、法规和国家政策，遵守社会道德风尚。坚持以国家环保产业大政方针和政策为指导，积极服务政府和会员单位，沟通会员与政府及社会的联系，起好桥梁纽带作用；收集排水行业信息，积极参与北京排水行业政策法规的编制、修订和排水设施建设发展及技术路线方案选择研讨；传播交流国内外先进技术和管理经验交流、研讨、培训和行业职工职业技能竞赛等活动；维护会员权益、加强行业自律、促进交流、促进全市排水企事业单位团结协作、共同进步，为加快北京市排水行业发展。<br>&nbsp;&nbsp;&nbsp;&nbsp;
                        目前，协会涉及了在北京城、郊区县注册经营的排水设施规划设计、运营管理、养护施工、大专院校、宣传媒体及排水设备生产售等多个行业，所有制经济成分涵盖了国企、民曹、合贸、股份等多方面。协会现设理事单位和会长、副会长单位两级领导机构，
                        8书处负责协会日常事务。<br>&nbsp;&nbsp;&nbsp;&nbsp;今后，随着协会发展和规模的扩大，将按北京市社团管理有关规定适时调整组织机构设置和数量等。随看首都经济的不断发展和环境保护的备受重视，发挥行业协会在行业管理与协调中作用的紧迫性日渐显现。北京排水协会要立北京水环境改善、水资源开发，在政府与会员单位之间发挥好桥梁与纽带作用。</span>
                                        </div>
                <div class="association-right-content" v-else-if="listIndex === 1">
                                            <div class="association-right-content1">
                                                <h4>第一章 总 则</h4>
                                                第一条 本团体定名为：北京排水协会（英文译名：Beijing Drainage Association，缩写：BDA）<br>
                        第二条 本团体由北京城市排水集团有限责任公司等9家单位自愿联合发起成立，是经北京市社会团体登记管理机关核准登记的非营利性社会团体。<br>
                        第三条 本团体的宗旨是：遵守宪法、法律、法规和国家政策，遵守社会道德风尚，在国家排水产业政策指导下，沟通会员、政府及社会，起桥梁纽带作用；传播交流国内外先进技术和管理经验，收集排水行业信息，为会员单位提供服务、促进交流，维护会员合法权益，促进全市排水企事业单位团结协作、共同进步，为加快北京市排水行业发展做贡献。<br>
                        第四条 本团体接受业务主管单位北京市水务局、社会团体登记管理机关北京市民政局的业务指导和监督管理。<br>
                        第五条 本团体的办公住所：北京市朝阳区高碑店甲1号。
                                                <h4>第二章 业务范围</h4>
                                                第六条本团体的业务范围是：<br>（一）研究排水行业发展的理论和方针政策；交流排水设施投融资、建设、运营和维护管理经验；<br>
                        （二）协助有关部门起草、修订、编制北京排水行业法规、标准、管理制度、操作规程等；<br>
                        （三）推广排水行业新技术、新成果、新工艺、新设备、新材料；<br>
                        （四）向有关部门反映排水行业中存在的问题并提出建议；<br>
                        （五）组织各种形式的交流、评估、绩效考核、培训等活动；<br>
                        （六）收集、整理、编辑排水行业信息。
                                                <h4>第三章 会 员</h4>
                                                
                                                    第七条本团体由单位会员组成。<br>
                                                    第八条申请加入本团体的会员，必须具备下列条件：<br>
                                                    （一）拥护本团体的章程；<br>
                        （二）有加入本团体的意愿；<br>
                        （三）在北京地区从事排水相关业务的企事业单位和经济组织。<br>
                        第九条会员入会的程序是：<br>
                        （一）提交入会申请书；<br>
                        （二）经理事会讨论通过；<br>
                        （三）由理事会授权的机构发给会员证。<br>
                        第十条会员享有下列权利：<br>
                        （一）本团体的选举权、被选举权和表决权；<br>
                        （二）参加本团体的活动权；<br>
                        （三）获得本团体服务的优先权；<br>
                        （四）对本团体工作的批评建议权和监督权；<br>
                        （五）入会自愿、退会自由。第十一条会员履行下列义务：<br>&nbsp;&nbsp;&nbsp;&nbsp;
                        （一）执行本团体的决议；<br>&nbsp;&nbsp;&nbsp;&nbsp;
                        （二）维护本团体的合法权益和声誉；<br>&nbsp;&nbsp;&nbsp;&nbsp;
                        （三）完成本团体交办的工作；<br>&nbsp;&nbsp;&nbsp;&nbsp;
                        （四）按规定交纳会费；<br>&nbsp;&nbsp;&nbsp;&nbsp;
                        （五）向本团体反映情况，提供有关资料。<br>
                        第十二条会员退会应书面通知本团体，并交回会员证。会员一年不交纳会费或不参加本团体活动，视为自动退会。<br>
                        第十三条会员如有严重违反本章程的行为，经理事会表决通过，予以除名。<br>
                                                
                                                <h4>第四章 组织机构</h4>
                                                    
                        第十四条本团体的最高权力机构是会员大会，其主要职责是：<br>
                        （一）制定和修改章程；<br>
                        （二）选举和罢免理事、监事；<br>
                        （三）审议理事会工作报告、财务报告及监事会工作报告；<br>
                        （四）决定重大变更和终止事宜；<br>
                        （五）制定和修改会费标准；<br>
                        （六）决定其他重大事宜。<br>
                        第十五条会员大会每年至少召开一次。会员大会须有2/3以上的会员出席方能召开，其决议须经到会会员2/3以上表决通过方能生效。<br>
                        第十六条会员大会每届五年。召开换届会员大会30日前，应将换届准备材料送至业务主管单位和社会团体登记管理机关审查，确认符合换届条件后方可召开。因特殊情况需提前或延期换届的，须由理事会表决通过，报业务主管单位审查并经社会团体登记管理机关批准同意。但延期换届最长不超过1年。<br>
                        第十七条理事会在会员大会闭会期间执行会员大会的决议，领导本团体开展日常工作，对会员大会负责。<br>
                        第十八条理事会每年至少召开一次会议，理事会的职责是：<br>
                        （一）执行会员大会的决议；<br>
                        （二）选举和罢免理事长、副理事长；<br>
                        （三）筹备召开会员大会；<br>
                        （四）向会员大会报告工作和财务状况；<br>
                        （五）决定会员的吸收或除名；<br>
                        （六）决定办事机构、分支机构、代表机构、实体机构的设立和办公住所的变更；<br>
                        （七）决定秘书长、副秘书长、各机构主要负责人的聘任；<br>
                        （八）领导本团体各机构开展工作；<br>
                        （九）制定内部管理制度；<br>
                        （十）接受监事会提出的对本团体违纪问题的处理意见，提出解决办法并接受其监督；<br>
                        （十一）决定其他重大事项。<br>
                        第十九条理事会须有2/3以上理事出席方能召开，其决议须经到会理事2/3以上表决通过方能生效。<br>
                        第二十条本团体的理事长、副理事长、秘书长必须具备下列条件：<br>
                        （一）坚持党的路线、方针、政策，政治素质好；<br>
                        （二）在本团体业务领域内有较大影响；<br>
                        （三）最高任职年龄不超过70周岁，秘书长为专职，采取聘任制；<br>
                        （四）身体健康，能坚持正常工作；<br>
                        （五）未受过剥夺政治权利的刑事处罚的；<br>
                        （六）具有完全民事行为能力。<br>
                        第二十一条本团体的法定代表人由魏增寿担任，代表本团体签署有关重要文件。本团体的法定代表人不得同时担任其他社会团体的法定代表人。<br>
                        第二十二条理事长任期不超过两届，本团体理事长行使下列职权：<br>
                        （一）召集和主持理事会；<br>
                        （二）检查会员大会、理事会决议的落实情况。<br>
                        第二十三条本团体秘书长行使下列职权：<br>
                        （一）主持办事机构开展日常工作，组织实施年度工作计划；<br>
                        （二）协调各分支机构、代表机构、实体机构开展工作；<br>
                        （三）提名副秘书长以及各办事机构、分支机构、代表机构和实体机构的主要负责人，交理事会决定；<br>
                        （四）决定办事机构、代表机构、实体机构专职工作人员的聘用；<br>
                        （五）处理其他日常事务。<br>
                        第二十四条本团体设监事会，由三人组成，由会员大会选举产生，向会员大会负责。其主要职责是：<br>
                        （一）选举产生监事长；<br>
                        （二）出席理事会；<br>
                        （三）监督本团体及领导成员依照《社会团体登记管理条例》和有关法律、法规开展活动；<br>
                        （四）督促本团体及领导成员依照核定的章程、业务范围及内部管理制度开展活动；<br>
                        （五）对本团体成员违反本团体纪律，损害本团体声誉的行为进行监督；<br>
                        （六）对本团体的财务状况进行监督；<br>
                        （七）对本团体的违法违纪行为提出处理意见，提交理事会并监督其执行。<br>
                        <h4>第五章 资产管理</h4>
                        第二十五条本团体经费来源：<br>
                        （一）会费；（二）捐赠；<br>
                        （三）政府资助；<br>
                        （四）在核准的业务范围内开展活动或服务的收入；<br>
                        （五）利息；<br>
                        （六）其他合法收入。<br>
                        第二十六条本团体按照会员大会制定或修改的会费标准收取会员会费。<br>
                        第二十七条本团体经费必须用于本章程规定的业务范围和事业的发展，不得在会员中分配。<br>
                        第二十八条本团体建立严格的财务管理制度，保证会计资料合法、真实、准确、完整。<br>
                        第二十九条本团体配备具有专业资格的会计人员。会计不得兼任出纳。会计人员必须进行会计核算，实行会计监督。会计人员调动工作或离职时，必须与接管人员办清交接手续。<br>
                        第三十条本团体的资产管理执行国家规定的财务管理制度，接受会员大会和有关部门的监督。资产来源属于政府拨款或者社会捐赠、资助的，必须接受审计机关的监督，并将有关情况以适当方式向社会公布。<br>
                        第三十一条本团体换届或更换法定代表人之前必须接受社会团体登记管理机关和业务主管单位组织的财务审计。<br>
                        第三十二条本团体的资产任何单位、个人不得侵占、私分和挪用。<br>
                        第三十三条本团体专职人员的工资和保险、福利待遇，参照国家对事业单位的有关规定执行。<br>
                        <h4>第六章终止程序</h4>
                        第三十四条本团体完成宗旨、自行解散或由于分立、合并等原因需要注销的，由理事会提出终止动议。<br>
                        第三十五条本团体终止动议须经会员大会表决通过，并报业务主管单位审查同意。<br>
                        第三十六条本团体终止前，须在业务主管单位及有关机关指导下成立清算组织，清理债权债务，处理善后事宜。清算期间，不得开展清算以外的活动。<br>
                        第三十七条本团体经社会团体登记管理机关办理注销登记手续后即为终止。<br>
                        第三十八条本团体终止后的剩余财产，在业务主管单位和社会团体登记管理机关的监督下，按照国家有关规定，用于发展与本团体宗旨相关的事业。<br>
                        <h4>第七章 附 则</h4>
                        第三十九条本章程经2018年7月20日会员大会表决通过。<br>
                        第四十条本章程的解释权属本团体的理事会。<br>
                        第四十一条本章程自社会团体登记管理机关核准之日起生效。<br>
                    </div>
                </div>
                <div class="association-right-content" v-else-if="listIndex === 2">
                    <div class="association-right-content1">
                        第一条 为规范北京排水协会（已下简称“协会”）印章管理相关工作，明确印章的全生命周期管理事项和程序、规范用印审批程序等相关事宜，依法维护协会权益和形象，依据国务院《关于国家行政机关和企业事业单位社会团体印章管理规定》和北京市有关规定，结合协会实际，制定本办法。<br>
                        第二条 本办法规范的印章为公章。<br>
                        第三条 印章的使用和管理，应造循全生命周期管理原则和谁使用、谁管理、谁负责的原则。<br>
                        第四条 印章使用和管理职责分工
                        秘书处负责协会公章的使用和管理；具体办理印章启用申请、领用等。印章须存放在固定、安全的地点，防止被盗或他人任意取用。出现印章丢失等情况时应立即报告，并及时采取补救措施。
                        第五条 印章保管和使用须指定专人负责。因工作需要临时指派他人负责保管和使用的，应做好相关工作交接。<br>
                        第六条 印章刻制须委派专人携带介绍信等相关证明材料，到公安机关指定的刻章单位进行刻制。任何单位不得擅自刻制印章。印章的形体和规格，执行国务院《关于国家行政机关和企业事业单位社会团体印章管理的规定》（国发（1999]25号）。<br>
                        第七条 印章使用严格执行审批程序，申请用印经办人需填写《北京排水协会用印申请单》，原则上不允许外出用印，确因工作需要，须经领导批准，印章可交由用印人员或指派专人负责，并确保外出期间印章保管和使用安全。<br>
                        第八条 发生下列情形之一的，印章应当停止使用：<br>
                        （一）印章物理形态原因，导致印章无法有效识别、影响使用等的情况。<br>
                        （二）印章遗失、盗抢等原因，导致印章使用和管理机构不能再有效、实际控制等的情况。<br>
                        （三）其他应当停用的情形。<br>
                        停用的印章须在10个工作日内交秘书长封存造册归档。<br>
                        第九条 未遵守本办法，视行为情节、造成经济损失、社会影响等的程度，对相关责任人予以通报批评、经济处罚、降级、撤职等，直至解除劳动合同，并赔偿损失；构成犯罪的，由司法机关依法追究刑事责任。<br>
                        第十条 本办法由理事会负责解释。<br>
                    </div>
                    <br>
                    <br>
                    <img class='block-img' src="@/assets/img/test-1.jpg" alt="">
                </div>
                <div class="association-right-content" v-else-if="listIndex === 3">
                    领导团队
                </div>
                <div class="association-right-content" v-else-if="listIndex === 4">
                    组织架构
                </div>
                <div class="association-right-content" v-else-if="listIndex === 5">
                    分支机构
                </div>
                <div class="association-right-content" v-else-if="listIndex === 6">
                    <ul class="contactUS-ul">
                        <li class="contactUS-ul-item">
                            <h4>地址：</h4>
                            <span>西城区莲花池东路甲5号白云时代大厦B座2401室</span>
                        </li>
                        <li class="contactUS-ul-item">
                            <h4>邮箱：</h4>
                            <span>bjpsxh@bdc.cn</span>
                        </li>
                        <li class="contactUS-ul-item">
                            <h4>邮编：</h4>
                            <span>100038</span>
                        </li>
                        <li class="contactUS-ul-item">
                            <h4>电话：</h4>
                            <span>63377887</span>
                        </li>
                        <li class="contactUS-ul-item">
                            <h4>传真：</h4>
                            <span>63377887</span>
                        </li>
                        <li class="contactUS-ul-item">
                            <h4>乘车路线：</h4>
                            <span>319、47、54、523、695、9路白云桥西</span>
                        </li>
                    </ul>
                    <div>
                        <img src="@/assets/img/map001.png" alt="">
                    </div>
                </div>

            </div>
        </main>
    </div>
</template>
<script>
import bgTitle from '@/assets/img/title-box.png'

export default {
    data(){
        return {
            listNAV:['协会简介','协会章程','管理方法','领导团队','组织架构','分支机构','联系我们'],
            listIndex:0,
            bgTitle
        }
    },
    created(){
        this.init();
    },
    methods:{
        init(){
            this.listIndex = Number(this.$route.params.option);
        }
    }
}
</script>
<style lang="less" scoped>
.association{
    .width-1180{
        padding:30px 0;
    }
    .association-left{
        width:16%;
        .association-left-title{
            color:@color-blue;
            padding-bottom:12px;
        }
        .association-left-ul{
            text-indent:16px;
            .association-left-item{
                padding:6px 0;
                border-bottom:1px solid @color-e;
                font-weight:600;
                color:@color-black;
            }
            .association-left-item.active{
                background-color:@color-blue;
                color:white;
            }
        }
    }
    .association-right{
        width:80%;
        .association-right-title{
            background-size:100%;
            height:60px;
        }
        .association-right-content{
            padding-top:20px;
            .img-float{
                width:186px;
                float:left;
                padding-right:12px;
            }
            .block-img{
                display:block;
                width:80%;
                margin:0 auto;
            }
            span{
                color:@color-51;
                line-height:26px;
            }
            .association-right-content1{
                font-size:@size-min;
                color:@color-51;
                line-height: 26px;
                h4{
                    font-size:@size;
                }
            }
            .contactUS-ul{
                display:flex;
                flex-wrap: wrap;
                color:@color-51;
                line-height: 32px;
                margin-bottom:30px;
                .contactUS-ul-item{
                    width:50%;
                    h4{
                        display:inline-block;
                    }
                }
            }
        }
        
    }
}
</style>